#include "SoilParameters.h"
#include "GEO.h"

std::vector<SoilLayer> GetSoilLayers()
{
    static std::vector<SoilLayer> soilLayers
    {
        {9.8,18.0, 9.8, 22900, 114500},
        {6,19.5, 15.8, 20000, 100000},
        {100,19.3, 115.8, 36200, 181000},
        //{4.3, 21.14, 4.3, 30000, 109000}, // Толщина 4.3 м, γ=21.14 [кН/м3], E1=30000 [кПа], E2=109000 [кПа]
        //{100.0, 21.22, 104.3, 43000, 88000}, // Толщина 100 м, γ=21.22 [кН/м3], E1=43000 [кПа], E2=88000 [кПа]
    };

    return soilLayers;
}
